{"(31, 3621, 468)": "contains a statement or fact that is limited or restricted by the term \"only\". In the active examples, the attention head is highlighting a specific context or scenario where something is exclusive or unique. For example, \"Excersire can only work if you are following a proper diet\" implies that exercise alone is not enough.\n\nIn the inactive examples, the term \"only\" is often used to emphasize the sole purpose or aspect of something rather than indicating exclusivity or a limitation in a broader context. For example, \"for one reason and one reason only\" uses \"only\" to stress that there is just one reason, but it doesn't indicate a unique or restrictive situation that the attention head would look for.", "(31, 3621, 496)": "contains a statement or fact that is limited or restricted by the term \"only\". In the active examples, the attention head is highlighting a specific context or scenario where something is exclusive or unique. For example, \"Excersire can only work if you are following a proper diet\" implies that exercise alone is not enough.\n\nIn the inactive examples, the term \"only\" is often used to emphasize the sole purpose or aspect of something rather than indicating exclusivity or a limitation in a broader context. For example, \"for one reason and one reason only\" uses \"only\" to stress that there is just one reason, but it doesn't indicate a unique or restrictive situation that the attention head would look for.", "(31, 3621, 538)": "contains a phrase that describes a specific condition, purpose or limitation before the word \"only.\" In active examples, we see phrases like \"for informational purposes only,\" \"for one reason and one reason only,\" \"for general information purposes only,\" or \"for entertainment purposes only.\" These phrases define a specific context or reason which leads to the appearance of the word \"only\" at the end. On the other hand, in inactive examples, the word \"only\" is used in different contexts, without a clear specific condition or purpose preceding it.", "(31, 3621, 517)": "contains the word \"only\" at or near the end of a sentence or phrase and is used to emphasize a singular purpose, reason, or exclusivity. In the active examples, \"only\" is found either at the end of the sentence or closely following a clause which emphasizes a specific purpose (e.g., \"for educational purposes only\" or \"known only\").\n\nIn the inactive examples, although the word \"only\" is present, it does not hold the same emphasis on exclusivity or it is located at other positions in the text and not near the end. The context of \"only\" in inactive examples is often connected to being part of a condition or limitation (e.g., \"can only work if you are following\" or \"only available in Mexico\") and not used as a singular emphasis on purpose or reason.", "(31, 3621, 88)": "contains a phrase indicating a specific purpose or intention, generally followed by the word \"only\". In the active examples, the attention head recognizes patterns such as \"for...purposes only\", \"for reference purposes only\" or \"for entertainment purposes only\", highlighting a limitation or restriction on the information or content provided. In the inactive examples, the word \"only\" is either used differently in the context, such as \"only available\", \"only going to increase\", or \"known only\", or it is used as a part of multiple reasons and purposes, making it difficult for the attention head to identify a distinct pattern.", "(31, 364, 519)": "contains a context or phrase that implies a ranking, position, or sequence, often related to music, sports, or other performance-based scenarios. The attention head is inactive when the document contains numbers related to identification, phone numbers, parts, approvals, or other non-ranking contexts. The active examples usually involve some form of achievement or measurement of performance in a competitive or quantitative manner.", "(31, 364, 548)": "discusses a specific identification, contact, or reference number that is directly associated with an object, person, organization, or the process of identifying or contacting something or someone. In the active examples, the attention head detects scenarios involving tax identification numbers, phone numbers, IMEI numbers, and mobile numbers. In contrast, the attention head remains inactive on documents discussing rankings, album chart positions, or parts and order numbers, as these instances are usually not specifically concerned with identifying or contacting a target in the same direct manner as the numbers in active examples.", "(31, 364, 525)": "contains a specific reference to a certain type of number, such as a phone number, access number, or relates to ranking (e.g., peaking at number). The attention head is inactive when the document mentions numbers that are more associated with identification or categorization, such as exhibit numbers, approval numbers, tax identification numbers, part numbers, or Social Security numbers. To summarize, the attention head is active when the document discusses usage, function, or rank-related numbers but is inactive when the document presents number references as identification or cataloging purposes.", "(31, 2918, 558)": "contains phrases that use the word \"go\" in the context of comparisons or examples. Specifically, it becomes active in cases where the phrases \"as far as,\" \"way to go,\" or \"let go\" appear in the document, indicating that the attention head is looking for instances where the word \"go\" is used in these comparative or descriptive expressions. In the inactive examples, the word \"go\" is used in different contexts, such as referring to actions, situations, or directions, which do not trigger the attention head for this specific purpose.", "(31, 2918, 505)": "contains the phrase \"come and go\" or variations of it, which implies a focus on things or events that happen temporarily, periodically, or cyclically. In these active examples, the attention head is likely picking up on the idea of change or transience. In the inactive examples, the phrase \"come and go\" or similar variations are not present, and instead, the word \"go\" is used in different contexts (such as comparisons, movement, or progress). As a result, the attention head is not active since the context it specializes in is not relevant in these examples.", "(31, 2918, 496)": "contains the phrase \"come and go\" or variations of it, which implies a focus on things or events that happen temporarily, periodically, or cyclically. In these active examples, the attention head is likely picking up on the idea of change or transience. In the inactive examples, the phrase \"come and go\" or similar variations are not present, and instead, the word \"go\" is used in different contexts (such as comparisons, movement, or progress). As a result, the attention head is not active since the context it specializes in is not relevant in these examples.", "(31, 2918, 576)": "discusses actions, events, or situations that are expected or suggested to happen, often involving a sense of direction, movement, or progress. In the active examples, the sentences tend to describe a process, a change, or an action that involves going towards a goal or destination, such as \"a long way to go,\" \"providing cheaper and sustainable energy supplies,\" or \"willing to shell out huge amounts of money to go.\" In the inactive examples, the use of \"go\" is more related to comparisons (e.g., \"as far as capital cities go\"), temporal changes (e.g., \"seems to come and go\"), or simple descriptions (e.g., \"on-the-go\") without strongly suggesting a specific action or direction.", "(31, 2918, 453)": "contains a more complex structure or context, and where the phrase \"to go\" or \"the go\" is used either at the end of the document or followed by additional context. In the inactive examples, the phrase \"to go\" or similar variations are often used in simpler or comparative contexts without much additional information or description provided. In general, the active examples contain richer and more detailed information surrounding the use of \"go,\" making the attention head more crucial for prediction in these cases.", "(31, 4378, 538)": "contains phrases implying a combination, joining, or merging of two or more elements or ideas. In the active examples, we can see expressions like \"bring these two worlds together\", \"put two and two together\", \"glue all of the pipe sections together\", which suggest a process of combining or connecting things.\n\nIn the inactive examples, the word \"together\" is often used in a different context or doesn't play a central role in the action of combining things. For instances, phrases like \"used together\", \"in turn leads to\", \"taken together\", and \"coming together\" do not convey the same sense of merging or joining things as in the active examples. In some cases, \"together\" is part of a longer phrase such as \"healthcare leaders, technology experts, and visionaries together\", which is structurally different from the active examples.", "(31, 4378, 423)": "mentions the concept of things or elements coming together or being brought together, but not in cases where the phrase \"taken together\" is used or where the sense of combining is not directly expressed. It seems to be sensitive to the specific way in which the idea of joining or merging is conveyed in the text, and not just the general notion of togetherness.", "(31, 4378, 575)": "mentions an action or process that involves combining, connecting, or assembling things or ideas. In the active examples, we see phrases like \"come together,\" \"tie together,\" \"glue together,\" and \"merge projects,\" which all indicate a joining or unification of elements. In the inactive examples, though some documents mention \"together\" and seem related to combining/connecting, they often use \"taken together\" as a phrase to connect different scientific findings, which doesn't involve the action of physically or conceptually bringing separate elements into a unified whole, and is more of a summarization or linking of findings.", "(31, 4378, 123)": "ends with the phrase \"Taken together.\" It seems to be specifically looking for this phrase at the end of a document to predict the last token \"together.\" In the inactive examples, even though the word \"together\" appears in various contexts, it is not preceded by the word \"Taken,\" and thus the attention head remains inactive. The attention head is sensitive to the specific context of \"Taken together\" and does not activate for other variations or uses of the word \"together.\"", "(31, 4378, 106)": "ends with the phrase \"Taken together.\" It seems to be specifically looking for this phrase at the end of a document to predict the last token \"together.\" In the inactive examples, even though the word \"together\" appears in various contexts, it is not preceded by the word \"Taken,\" and thus the attention head remains inactive. The attention head is sensitive to the specific context of \"Taken together\" and does not activate for other variations or uses of the word \"together.\"", "(31, 4378, 88)": "ends with the phrase \"Taken together.\" It seems to be specifically looking for this phrase at the end of a document to predict the last token \"together.\" In the inactive examples, even though the word \"together\" appears in various contexts, it is not preceded by the word \"Taken,\" and thus the attention head remains inactive. The attention head is sensitive to the specific context of \"Taken together\" and does not activate for other variations or uses of the word \"together.\"", "(31, 988, 525)": "contains a phrase or concept that is being referred or defined using the term \"called\" without using the structure \"also called\". In other words, the attention head activates when \"called\" is used to introduce or explain a term, concept, or phenomenon, rather than as a way to provide an alternative name for something. In the inactive examples, the term \"also called\" is used to provide another name for the subject being discussed, which doesn't seem to trigger this attention head.", "(31, 988, 558)": "contains a phrase where a specific term, concept, or mechanism is introduced and then immediately defined or referred to using the term \"called.\" In other words, the attention head is activated when there is a direct association between a previously mentioned item and the term \"called.\" \n\nIn the inactive examples, the term \"called\" is often preceded by an additional descriptor (e.g., \"also called\" or \"sometimes called\"), or the association between the preceding concept and the term \"called\" is not as direct or immediate. This difference in structure or phrasing may be the reason why the attention head remains inactive in these cases.", "(31, 988, 371)": "contains a term, name, or concept followed by a comma and the word \"also\" or \"sometimes\" before the token \"called\". In these cases, it identifies an alternative name or term for a particular subject. In the inactive examples, the context surrounding the token \"called\" does not follow this pattern, and instead, \"called\" is used in different ways such as referring to something someone called it, what is sometimes called, or explaining a condition without the specific \"also called\" pattern.", "(31, 988, 492)": "contains a name or description for something, followed by a comma and the word \"also\" or a similar word (like \"sometimes\" or \"as it came to be\"), and then the word \"called.\" The attention head is looking for instances where an alternate name or term is being introduced for a particular subject, concept or thing.\n\nIn the inactive examples, the head is not active because either \"called\" is not the last word, or the context doesn't contain an alternate name introduction in the format observed in the active examples. There might be similar phrasing or the word \"called\" present, but the overall structure does not meet the specific pattern that activates this attention head.", "(31, 988, 483)": "uses words or phrases like \"also called,\" \"as it came to be called,\" or \"sometimes called\" directly before the last token \"called.\" It seems to be more focused on identifying instances where an alternative name or term is given immediately before the word \"called.\"\n\nIn the inactive examples, the word \"called\" is often preceded by phrases such as \"what he called,\" \"what is sometimes called,\" \"a condition called,\" or \"sometimes called\" with additional information in between, making this attention head inactive in those cases. The difference between active and inactive examples relies on the presence or absence of a direct attributive phrase preceding the token \"called.\"", "(31, 988, 390)": "contains a term or phrase followed by a comma and the word \"also\" before the token \"called\". This pattern suggests that the attention head is looking for alternative names or terms for a subject, and it activates when the document structure follows this specific pattern. In the inactive examples, although some may contain the word \"called\", it doesn't follow the pattern of having a term or phrase followed by a comma and the word \"also\".", "(31, 2658, 538)": "refers to a new or initial occurrence, discovery, or experience of a particular thing or event, usually indicated by phrases like \"for the first\" or \"here first.\" In the active examples, the subject is often described to be occurring for the first time, a report or description is being made about it, or a new insight is presented. In contrast, the attention head is inactive when \"first\" is used as a standalone word without any connection to a specific event or experience, or when the \"first\" phrase is not implying the novelty of an occurrence or discovery.", "(31, 2658, 492)": "contains phrases indicating an initial discovery, achievement, or action, such as \"for the first\", \"in the first\", or similar variations. These phrases typically imply that something is happening or being reported for the first time. In contrast, the attention head is inactive when the document contains phrases like \"first things first\" or \"meeting for the first\", which do not focus on a novel or first-time occurrence. In summary, the attention head is activated by the context of an initial discovery or action, making it more likely to predict the last token as \" first\" in these situations.", "(31, 2658, 525)": "mentions something happening or being reported \"for the first\" time or when it emphasizes a new discovery, knowledge, or experience. The attention head focuses on the context where the phrase \"for the first\" appears to indicate novelty, which is not the case in the inactive examples. In the inactive examples, the word \"first\" is often used to indicate the order or priority but doesn't suggest something is happening for the first time or a new discovery.", "(31, 2692, 492)": "contains a reference to a change in a situation, state, or behavior compared to the past, often indicating a transition or adaptation. In the active examples, there is a clear reference to a contrast between the past and the present, such as \"not working like it used\" or \"New version releases of browsers aren’t getting the buzz that they used.\" In the inactive examples, the focus is more on descriptions, conditions, or actions without emphasizing a significant change or comparison to the past, such as \"nose. Likewise, his vision wasn't what it used\" or \"memory isn't what it used.\"", "(31, 2692, 466)": "has a context or situation that has changed or evolved over time and the last token \"used\" indicates a comparison between the past and present state. The attention head remains inactive in documents where the last token \"used\" is a part of a phrase implying adaptation or getting accustomed to something, without a clear comparison between past and present situations.", "(31, 2692, 559)": "mentions a change or transformation in the subject's state or condition over time. It gets activated when the context implies that something was different in the past compared to the present situation, especially when the change is significant or impactful. In the active examples, we can notice shifts in vision, organizational culture, geographical indications, recognition, or the buzz surrounding releases. In the inactive examples, the focus is more on getting used to something or adapting to a current state rather than highlighting a substantial change in the subject.", "(31, 2692, 504)": "mentions a change or difference from a past state or condition, generally implying that something isn't as it was previously or has significantly evolved. In many of the active examples, the attention head focuses on phrases like \"wasn't what it used,\" \"back to where they used,\" \"not as easy as it used,\" and so on, highlighting that the situation, state, or condition has changed from what it once was. In contrast, the inactive examples often include the verb \"used\" in a different context, such as getting accustomed to something, without necessarily implying a significant change from a past state or condition.", "(31, 4941, 538)": "has a context that implies a specific action, event, or outcome is expected or needs to be completed within a certain timeframe or deadline. It seems to be triggered by phrases that describe a time-bound process, task, or result. In the inactive examples, although a time frame is mentioned, they revolve around an individual's personal choice or preference, and the context does not involve a specific action or outcome to be completed within the mentioned time.", "(31, 4941, 466)": "contains a situation or action that has a specific time frame or deadline in which it should be completed or is expected to occur. In the active examples, there is an emphasis on the need for a response, completion, or occurrence within a certain time limit, while in the inactive examples, the emphasis is more on the consequences or results, rather than the necessity of meeting a specific deadline.", "(31, 4941, 492)": "is discussing a specific action or event that is expected to occur or be completed within a certain time frame. It seems to focus on the idea of something happening \"within\" a given time or context. In the inactive examples, the context is broader and the focus is not specifically on something being completed or occurring within a specific time frame.", "(31, 2415, 525)": "mentions a direction, a distance, or a specific manner, typically using \"all the way,\" \"this way,\" or \"that way.\" It seems to focus on phrases highlighting a particular way or process, whereas it stays inactive for documents that use the concept of \"way\" more passively or in comparison, such as \"other way around,\" \"either way,\" or \"the other way.\"", "(31, 2415, 470)": "contains phrases that end with \"way\" and are used to describe a certain method, approach, or perspective. In these instances, \"way\" often appears immediately after words like \"this,\" \"that,\" or \"either,\" and the sentences generally express an opinion or perspective on a given topic. In the inactive examples, the word \"way\" is used more literally to denote distance, direction, or as part of an idiom or a more complex phrase. Essentially, the attention head is activated when \"way\" is used as a figurative expression to represent a concept or method, rather than its literal meaning.", "(31, 2415, 60)": "contains phrases that use the word \"way\" in a specific context, such as expressing a particular manner, direction, or perspective. The attention head seems to be sensitive to phrases like \"this way,\" \"that way,\" \"other way,\" and \"his way.\" It is inactive in cases where the word \"way\" is used to indicate distance (e.g., \"all the way\") or in a more general context (e.g., \"exact same way,\" \"doesn't quite work that way\").", "(31, 2415, 88)": "contains phrases that indicate a change of direction, reversal, or a contrasting situation, often involving the term \"other way\" or \"gives way.\" In the inactive examples, the term \"way\" is primarily used to denote distance, a route, or a manner of referring to something without emphasizing a change or contrast.", "(31, 2415, 492)": "contains the word \"way\" being used in an idiomatic or abstract sense, rather than denoting a physical direction, distance, or location. For example, in active documents, phrases like \"this way\" or \"that way\" are used either metaphorically or to describe methods, whereas in inactive documents, \"way\" is mostly used in phrases like \"all the way\" or \"other way,\" describing a physical or literal spatial context or referring to reversal or opposites.", "(31, 1407, 123)": "contains phrases indicating a revelation, discovery, or conclusion, such as \"let's find out,\" \"turns out,\" \"read on to find out,\" or similar variations. In the inactive examples, these phrases are either absent, have a different structure, or are part of a more complex sentence that changes the context.", "(31, 1407, 60)": "has a structure that builds suspense or curiosity within the reader by using phrases like \"turns out,\" \"find out,\" or \"read on.\" Usually, these phrases appear near the end of the document and indicate that a revelation or result is about to be disclosed. In the examples provided, the active attention head is triggered by these phrases as they create a sense of anticipation for the last token \"out.\" In the inactive examples, the attention head remains inactive because these phrases - or a similar mechanism to generate suspense - are either absent or placed differently within the document, thus not contributing to the prediction of the last token \"out.\"", "(31, 1407, 88)": "contains phrases like \"it turns out,\" \"as it turns out,\" \"read on to find out,\" or \"to find out\" that indicate a revelation or discovery is about to be explained or shared. These phrases usually appear at the end of sentences or paragraphs, leading to a conclusion or moment of understanding.\n\nIn the inactive examples, phrases like \"let's find out,\" \"turns out\" (without the preceding \"it\"), and \"it turned out\" do not perfectly match the patterns observed in the active examples. Additionally, these inactive examples might also lack the context of a revelation or explanation to follow, making the attention head inactive.", "(32, 4964, 538)": "contains a phrase where \"too\" is used to emphasize an excessive degree of a particular action or quality. In the active examples, phrases like \"trying far too\", \"take it way too\", \"don't tighten the nut too\", \"not a moment too\", and \"pushing himself too\" show that the attention head is focused on situations where the excessive degree of something is significant. In the inactive examples, the usage of \"too\" is either part of a larger expression (e.g., \"going into too much graphic detail\") or is not emphasizing the excessive degree of an action (e.g., \"I have way too\"). As a result, the attention head is not activated in those cases.", "(32, 4964, 492)": "contains a phrase indicating an excessive or extreme aspect, such as \"far too,\" \"way too,\" or \"pushing himself too.\" In these instances, the attention head helps to predict the last token as \"too.\" This attention head is likely focusing on contextual patterns that suggest an emphasis on excessive amounts or actions. In the inactive examples, the term \"too\" is still present, but it may not be associated with an emphasized extreme or excess, and therefore the attention head remains inactive.", "(32, 4964, 517)": "contains a phrase or structure that indicates a limit or a threshold being reached or approached, often in the context of an action, condition or advice. Additionally, it seems like the head is more sensitive to phrases that are close to the end of the document.\n\nIn the active examples, the attention head is triggered by phrases such as \"don't tighten the nut too\", \"if it takes too\", \"pushing himself too\", \"allowed to drop too\", and \"before it's too\". In each of these, the phrase indicates a situation where something is being pushed towards or beyond its acceptable or desired limit.\n\nIn the inactive examples, there are instances where the word \"too\" is being used, but it either doesn't convey the same sense of reaching or approaching a limit, or is not near the end of the document. For example, in \"you’ll look like you’re trying far too\", the expression \"far too\" is more about expressing an extreme degree rather than approaching a limit.", "(32, 2412, 88)": "contains a context where \"will\" is used in relation to decision-making, future actions, or referring to a legal document (like a last will and testament). It seems to be inactive in cases where \"will\" is used as an auxiliary verb to indicate future tense or to express probability, or when it is part of an expression that doesn't involve decision-making or planning.", "(32, 2412, 123)": "mentions \"will\" in a context that implies choice, flexibility, or control. In the active examples, \"will\" is used to convey decision-making, changing at one's discretion, or expressing an opinion. In the inactive examples, \"will\" is often associated with more fixed scenarios, such as legal documents (like a last will and testament), predetermined events, or passive contexts.", "(32, 4282, 492)": "mentions a current situation, ongoing action, or a recent event that emphasizes the present or immediate time. In the inactive examples, the context is focused on the future, importance, or a specific condition that doesn't highlight the immediate or present situation.", "(32, 4282, 466)": "ends with a statement or phrase that is either emphasizing or focusing on the current or immediate situation, or describing a specific point in time. In the active examples, the phrases often include the word \"right\" repeated twice at the end, while in some cases it's used only once but it still points to an exact or immediate moment. On the other hand, the head is inactive when the context still mentions the word \"right\", but the emphasis is more on a general or future situation, or the word \"right\" is used in a different context like \"playing right\" or \"right now\".", "(32, 4282, 538)": "ends with \"right\" or \"right right\" without referring to a specific time, event, or situation related to the future. In the inactive examples, the attention head is not active because the sentences mostly mention a specific time (for example, \"10 years from right\"), involve future events (like \"dividend 3 years from right\"), or talk about a particular situation, player or place (such as \"MVP playing right right\" or \"Ring of Honor right right\").", "(32, 3151, 546)": "contains repetitive actions or phrases, usually involving the use of the word \"same\" or an equivalent concept, followed by the term \"over and over\". It seems that the attention head is triggered by the idea of repetition, and specifically when it is linked to the phrase \"over and over\". In other words, the attention head is sensitive to patterns in the text that emphasize repeated actions, events or phrases, and this repetition is usually mentioned at the end of a sentence or clause.", "(32, 3151, 496)": "contains repetitive actions or phrases, usually involving the use of the word \"same\" or an equivalent concept, followed by the term \"over and over\". It seems that the attention head is triggered by the idea of repetition, and specifically when it is linked to the phrase \"over and over\". In other words, the attention head is sensitive to patterns in the text that emphasize repeated actions, events or phrases, and this repetition is usually mentioned at the end of a sentence or clause.", "(32, 3151, 393)": "contains the structure \"same\" followed by a noun or verb, followed by \"over and over\" or just \"over and over\" without other additional actions or elements. In some cases, it may also be active when there's a repeated action or element in the document.\n\nIn the inactive examples, the attention head does not seem to be active because it does not follow the specific structure observed in the active examples. For instance, \"repeats the same line over and over\" switches the order of \"repeats\" and \"the same\", and phrases like \"I repeat over and over\" or \"Remembering it over and over\" do not include the word \"same\" in the structure. Moreover, in the example with \"% year over year\", the context is different, and \"over\" appears within a different phrase, not in the context of repetitive actions or elements.", "(32, 1155, 60)": "ends with a phrase that suggests a revelation, discovery, or conclusion is being made, often using the words \"turns out\" or \"find out.\" These phrases usually indicate that the final piece of information is being disclosed, creating anticipation for the reader. The attention head is inactive when the document doesn't end with such phrases, even if they contain the words \"out\" or \"find out\" in a different context.", "(32, 1155, 123)": "contains phrases that indicate a revelation, discovery, or suspense about the outcome of a situation or information. In the active examples, the phrases like \"turns out,\" \"find out,\" and \"it turns out\" are used, which indicate that the reader is about to learn something new or there's a sense of anticipation. In the inactive examples, these elements of revelation or suspense are missing, so the attention head remains inactive.", "(32, 1155, 88)": "ends with a phrase that indicates a revelation, discovery, or conclusion, such as \"turns out,\" \"find out,\" or \"turned out.\" It is inactive in documents that do not have this kind of concluding phrase at the end, or if the ending phrase is not specifically related to a revelation or discovery. Some of the inactive examples include a document ending with a general statement (\"year in and year out\") or an unrelated statement (\"Rated 5 out of 5\").", "(32, 1386, 538)": "contains a repetition of the word \"once\" or a pattern where the word \"once\" is used as a modifier to emphasize the happening of an event or action for a particular time or situation. In most active examples, we can see the word \"once\" is either repeated twice or used in a context that emphasizes a particular action. In the inactive examples, the word \"once\" is either not repeated or not used as a modifier that emphasizes the event.", "(32, 1386, 492)": "discusses a situation or event that is happening again or has the potential to happen again, usually after a certain period of time or due to some specific circumstances. In these cases, the word \"once\" is often used to emphasize the recurrence, repetition, or another chance for this event or situation. The attention head seems to be triggered by phrases that express the idea of revisiting, returning, or repeating an event or situation.\n\nIn most of the active examples, words or phrases such as \"again\", \"new decade\", \"after\", \"back\", or \"yet\" are used in the sentences, which signal a recurring or repetitive theme. In the inactive example, the sentence doesn't imply any sense of repetition or recurrence in the context provided, thus not activating the attention head.", "(32, 3582, 531)": "contains phrases implying some action, event, or emotion directed towards \"her\" or involving \"her\" in a more prominent way. In the active examples, we can observe actions like \"ILOE her\", \"push her\", \"give it to her\", \"tell her\", or \"attempts to rape her\". Also, some phrases show a stronger emotional connection or focus on \"her\", like \"think of her every second\" or \"support from those around her\". \n\nIn the inactive examples, although \"her\" is present, it is not associated with a significant action, emotion, or event. Instead, these instances mostly talk about situations or descriptions involving \"her\". For instance, \"she had forgotten to ask\", \"send today\", or \"drawing conclusions\" do not create a strong focus on the token \"her\". Overall, the attention head becomes active when \"her\" has a prominent role in the context of the document, mainly linked to actions or emotions directed towards \"her\".", "(32, 3582, 403)": "mentions \"her\" in the context of performing an action, being directly affected by an action, or possessing a certain quality or characteristic. The attention head focuses on sentences where \"her\" plays a significant role in the context, such as being the subject or object of the action, or when something is being described or done specifically for or towards \"her\". In the inactive examples, the mention of \"her\" is less central to the main action or context of the sentences, or the sentences don't express an action related to \"her\" directly.", "(32, 3582, 549)": "mentions an action or event directly involving \"her\" or describes a situation where \"her\" is being affected or influenced by something or someone. The attention head tends to activate in sentences where \"her\" appears as an object or a possessive pronoun, showing a clear relation between \"her\" and the context.\n\nIn the inactive examples, \"her\" is either part of a subject or in a context where the relationship between \"her\" and the action or event is less direct or more general.", "(32, 3582, 512)": "contains a reference to an action, behavior, or event involving \"her\" and the context surrounding that action or event is important for understanding the meaning of the sentence. In the active examples, the attention head focuses on situations where \"her\" is doing something, being influenced by something, being described, or experiencing a specific scenario. In the inactive examples, the sentences mostly describe situations where \"her\" is simply present or being referred to without any significant action or event happening to or involving her.", "(32, 4882, 489)": "mentions a specific type of class or provides context or details about the class, such as an adjective describing the class (e.g., \"yoga,\" \"music appreciation,\" or \"gender studies\") or information about the class's schedule, frequency, or level (e.g., \"evening classes,\" \"once-a-week,\" or \"introductory general physics\"). In the inactive examples, the class is often referred to more generally or lacks specific context or details (e.g., \"an aerobics class,\" \"regularly attended yoga class,\" or \"skipped class\").", "(32, 4882, 605)": "contains some specific information or context about the class, such as the subject or topic of the class (e.g., yoga, physics, music appreciation), the timing or frequency of the class (e.g., evening classes, once-a-week), or the actions or behaviors related to the class (e.g., teaching, skipping, attending). In the inactive examples, the document only mentions a type of class (e.g., aerobics, yoga, music and theater acting) without providing any further context or specific information about it.", "(32, 4882, 623)": "contains specific information about the class, such as the subject of the class (yoga, physics, soapmaking, dance, music, and theater acting) or an action related to attending or participating in the class. In contrast, it remains inactive when the document only mentions general information about a class, like the class schedule or a generic reference to attending class or teaching a class, without specifying the subject or activity associated with the class.", "(32, 4882, 527)": "mentions the word \"class\" in a more abstract or generalized context, referring to types of classes, attending or teaching classes, or thoughts about classes in general. In contrast, it is inactive when the document specifically talks about a particular class, the context of a class, or mentions the word \"class\" alongside an activity or subject, such as yoga, music, or physics.", "(32, 3477, 526)": "discusses or mentions the usage of a particular substance, tool, or system in a way that highlights the primary purpose or functionality of that substance, tool, or system. In the active examples, we see the attention head triggered by topics like substance use in youth gamblers, online assessment usage for hiring, cookie usage for website optimization, supplement use among women, and frequency of app usage. However, in the inactive examples, the usage is either in a more general context or mentioning usage without emphasizing the primary purpose of the item in question, such as a pen's cap covering the writing tip when not in use or the presence information not being widely in use.", "(32, 3477, 623)": "mentions a specific type of use, often related to a particular subject or context, such as \"substance use,\" \"supplement use,\" or \"in use.\" It is inactive when the document contains more general or nonspecific usage, such as \"continuing to use,\" \"of use,\" or \"make optimum use.\" The attention head is essentially activated when there is a clear and specific context or subject related to the usage, but not when usage is general or not clearly attributed to a particular topic.", "(32, 3477, 525)": "contains phrases or expressions that indicate a state of not being in use or transitioning from not in use to being in use, or the practical application of something. In the active examples, we see phrases like \"when not in use,\" \"widely in use,\" and \"put to practical use.\" These phrases signify the condition or application of an object or concept. In the inactive examples, the focus is on different aspects of \"use,\" like substance use, online use, or the frequency of use, which do not specifically address the state of being in use or not in use, or the practical application aspect.", "(32, 3477, 575)": "contains information discussing the application, practicality, or state of being in use of a particular object, system, or practice. The attention head seems to focus on instances where the concept of \"use\" is central to the context or purpose of the document, rather than just the presence of the word \"use\" in the text. In the inactive examples, the word \"use\" may appear, but it is not the main point of the text or the context of usage is different, such as substance use, agreeing to terms of use, or less frequent use.", "(32, 406, 525)": "mentions a comparison or emphasizes a quantity related to the word \"much.\" It seems to be activated when the document uses phrases like \"as much,\" \"too much,\" or \"times as much,\" focusing on the significance of the amount being discussed. In contrast, inactive examples include cases where \"much\" is used as a standalone term or in expressions that do not specifically highlight a comparison or a quantity, such as \"not so much\" or \"doesn't make much\".", "(32, 406, 623)": "contains a comparison or a relationship that involves a quantitative aspect or degree, often with the word \"much\" at the end of the statement or phrase. In the active examples, we can see phrases like \"ten times as much,\" \"richest 26 people in the world now own as much,\" and \"three times as much,\" showing a clear quantitative comparison. In the inactive examples, the context does not involve any such comparison or relationship, or the degree of relationship is not the main point of the statement.", "(32, 406, 538)": "mentions a comparison or a ratio with the term \"as much\" used to quantify the extent of difference between two things or situations. In the active examples, we can see that the attention head is looking for scenarios where there is a comparison with \"as much\" such as \"three times as much,\" \"ten times as much,\" or \"increase the effective size by as much.\" However, in the inactive examples, the term \"much\" is used in different contexts that do not involve a direct comparison or ratio, such as \"without going into too much,\" \"one of a kind, we put so much,\" or \"already causing too much.\"", "(32, 406, 519)": "contains a phrase that describes a certain amount or extent of something, usually indicated by the word \"much\" preceded by a qualifier such as \"so,\" \"as,\" or \"too\". In the active examples, the attention head is triggered by phrases like \"as much,\" \"so much,\" and \"too much,\" which show the degree or intensity of the described factor or action. In inactive examples, although some texts also contain the word \"much,\" the attention head is not activated because these instances do not emphasize a particular extent or degree in the same way as the active examples.", "(33, 1202, 466)": "mentions something that the author or subject has tried, attempted, or experienced in the past, often followed by \"so.\" It seems to be looking for phrases that describe past efforts or experiences and helps predict the last token, which is \"so,\" since it is often used in such contexts. In the inactive examples, the sentences do not refer to any past actions or attempts made by the author or subject. They mostly contain information, observations, or statistics that do not involve any personal action or experience.", "(33, 1202, 538)": "includes a quantifiable aspect (numbers, counts, rankings, or comparisons) or the document mentions an achievement, outcome, or progress being made. In the active examples, we can observe various references to numerical data or progress being made:\n\n- \"...222 units built so\"\n- \"...netted nine goals for the campaign so\"\n- \"...accruing just $710 so\"\n- \"...32 months in office so\"\n- \"...628 confirmed cases and 165 probable cases so\"\n\nOn the other hand, in inactive examples, the documents are generally more focused on explaining a problem, attempt, opinion, or a process without highlighting specific quantifiable aspects or achievements.", "(33, 1202, 492)": "ends with an incomplete or open-ended statement, implying that more information or an explanation is to follow, often marked by the word \"so\" at the end. In the active examples, the statements lead the reader to expect a continuation, while in the inactive examples, the statements are more complete, and the use of \"so\" doesn't create the same anticipation for more information.", "(33, 1202, 504)": "describes an ongoing situation, progress, or a series of events leading up to the current point. In the active examples, the sentences refer to a continuing process, a sequence of achievements or events, or a still-evolving experience. In contrast, the inactive examples present situations where the focus is on the current state, specific actions taken or attempted, or an isolated event. The attention head is triggered by the contextual information that indicates an ongoing or evolving situation.", "(33, 524, 548)": "refers to a specific condition or status of an object, often involving a change, maintenance, or prediction of that state. In the active examples, the attention head recognizes phrases like \"locked state,\" \"retracted state,\" and \"current state,\" which imply a change in the state or the significance of the particular state in the context. In the inactive examples, the state is described more passively or is inherent to the subject, such as \"hydrated state,\" \"partially unfolded state,\" and \"ketosis – a state.\" The attention head seems to be more focused on recognizing transitions, manipulations, or importance of a specific state rather than just the existence of a particular state.", "(33, 524, 602)": "mentions a change, condition, or description related to the state of an object, person, or system. In the active examples, the state is often referred to as inactive, non-conducting, or current, and sometimes includes descriptions like inebriated or catatonic. In contrast, the inactive examples often focus on a more technical description of the state, like hydrated, unfolded, locked, or ketosis, and the state is not characterized by a change or transition in condition.", "(33, 524, 483)": "describes a specific or particular condition, state, or form of an object, system, or process, often emphasizing that it exists or operates in that state. It seems to activate when there is a focus on the state of a subject in context to its functionality, stability, or activity. Inactive examples often contain more general descriptions or simply mention the state without emphasizing the existence or function within that state.", "(33, 524, 575)": "describes a specific state or condition that is typically temporary, unusual, or altered from the normal state. It is most likely activated when the context surrounding the word \"state\" gives an indication of an uncommon or altered situation. \n\nIn the active examples, we can see that the states described are often temporary or unusual, such as \"coma-like state,\" \"trance-like state,\" or \"catatonic state.\" On the other hand, in the inactive examples, the states mentioned are more standard, normal, or expected, such as \"initial ground state,\" \"inactive state,\" or \"hydrated state.\"", "(33, 1582, 617)": "contains abbreviations, acronyms, or notations followed by a period and a space before \"RandomRedditor.\" In the active examples, there are instances of abbreviated terms, such as \"i.v\", \"p.d.f\", \"J.D.\", \"D.C.\", and \"M.D., P.A.\", which seem to trigger the attention head. In the inactive examples, these abbreviations or notations are not present before \"RandomRedditor,\" and instead, there are party designations (e.g., \"D-Fla\", \"D-Calif\"), which are not followed by a period and a space.", "(33, 1582, 88)": "contains an abbreviation or acronym followed by a description or elaboration in parentheses, and this pattern occurs just before \"RandomRedditor\" in the text. In the active examples, we can observe abbreviations like \"i.v\", \"J.D\", \"D-Calif\", and \"D.C\", followed by their respective meanings or clarifying information enclosed in parentheses. In the inactive examples, this pattern is not present before \"RandomRedditor\", and therefore the attention head remains inactive.", "(33, 4446, 538)": "mentions a specific event or action that occurred or will occur in relation to a time frame. The active examples usually involve a past or future event with a general reference to when it took place or will take place, often using phrases like \"about,\" \"arrived,\" \"returned,\" or \"estimated.\" In contrast, the inactive examples do not show a clear connection between a particular event or action and an associated time frame, or they include specific numerical data instead of a general time reference.", "(33, 4446, 645)": "refers to an event or action that occurred in the past and the focus is on the time \"about\" which it happened. It is mostly triggered by phrases indicating the arrival of entities, actions performed by entities, or historical facts that require a time reference. In the inactive examples, the word \"about\" is used, but the context does not focus on the occurrence of an event in the past or the time when it happened; instead, these examples refer to measurements, estimates, durations, or general descriptions where the time of occurrence is not the central aspect.", "(33, 4446, 466)": "mentions an event, action, or development happening at a specific point in time or from a certain point in the past, and the last token \"about\" is used to indicate an approximate time frame or period. In the active examples, the attention head focuses on situations that involve historical events, species evolution, or geographical changes with a vague time reference using \"about\".\n\nIn the inactive examples, the documents contain mentions of specific events, situations, or descriptions, but the context around \"about\" does not refer to an approximate time frame or historical period. Instead, \"about\" is used to describe quantities, measurements, or specific moments, which are not the primary focus of this attention head.", "(33, 4446, 531)": "discusses a specific event, prediction, or scientific estimation related to time, usually involving a significant period (years, stages of development, or fiscal years) or a major subject matter (ancestors, evolution, milestones). In the active examples, the content tends to be more formal or technical and involves some evaluation or assessment. In contrast, the inactive examples are more casual or narrative and describe daily events or timeframes in a more informal manner, such as a person arriving at a location or an unremarkable period of time passing.", "(33, 4446, 517)": "is describing an estimation, measurement, description, or prediction related to a specific aspect or event. In the active examples, the attention head focuses on phrases that are providing details such as age, length, value, height, or duration. In the inactive examples, the term \"about\" is mainly used to convey the approximate time when an event occurred, but those examples do not provide specific details or descriptions related to the event.", "(33, 204, 492)": "describes an action, attempt or process, often related to software, technology, or programming, that leads to a specific outcome indicated by the mention of \"the following.\" In most active examples, the documents explain a user's experience or attempt in doing something that results in an outcome or a list of items. In the inactive examples, though some documents share the similar context or mention \"the following,\" the attention head is not triggered, likely due to lack of a clear action, attempt, or process that leads to an outcome or the lack of an explicit mention of \"the following\" as an outcome.", "(33, 204, 531)": "contains an ongoing or incomplete statement or description that suggests a list, conditions, or additional information to be mentioned after the word \"following.\" In other words, it is active when the context indicates that \"following\" introduces subsequent points, details, or items. In the inactive examples, the word \"following\" appears after an already complete statement or action, usually referring to a result or a message received without indicating that further items or information will follow.", "(33, 204, 470)": "contains a situation or problem that results in an outcome, usually an error message, a list, or a specific condition. Often, these active examples include phrases like \"getting the following,\" \"receiving the following,\" \"I get the following,\" or \"fails with the following.\" In contrast, the attention head is inactive when the document contains a description of code, data, or a scenario without explicitly mentioning an outcome or result. In these cases, the phrases used do not indicate that there is a particular outcome for which the attention head needs to be active.", "(33, 204, 123)": "describes a situation or issue that results in an outcome or consequence, which is typically an error, warning, or message. It seems to be activated when the writer is explaining a process or action they took and the result they obtained. In the inactive examples, the context is about defining, describing, or listing things rather than stating a specific action and its outcome. The attention head seems to focus on documents where the \"following\" token indicates there will be additional information referring to a result or output of a previously mentioned scenario.", "(33, 204, 88)": "describes a situation or context where an issue, error, or message is received or encountered, and the word \"following\" is used to introduce the specific error, message, or information. In most active examples, the word \"following\" is preceded by the phrases \"I receive,\" \"I get,\" or \"it gives me,\" indicating that the information being described comes after or as a result of the mentioned action or context. In the inactive examples, the word \"following\" is instead often used to refer to additional information or details that don't necessarily result from a specific action or context but are still relevant, or to describe a certain condition or state.", "(33, 4900, 492)": "contains a phrase that indicates a certain quantity, amount, condition, or measurement, followed by the word \"of.\" In the active examples, the attention head is triggered by phrases like \"minimum release voltage of,\" \"failure rate of,\" \"minimum heparin chain length of,\" and \"maximum saving of.\" In the inactive examples, the word \"of\" is not directly associated with a specific quantity, amount, or condition, and therefore the attention head remains inactive.", "(33, 4900, 483)": "contains a phrase describing a certain quantity, measurement, or value, often with a modifier like \"minimum,\" \"maximum,\" or \"total,\" followed by \"of.\" The examples that activate the attention head are characterized by such descriptions, while the inactive examples typically lack this pattern or include phrases that do not specifically involve a clear quantity or measurement followed by \"of.\"", "(33, 2322, 546)": "contains a phrase describing a position or action related to \"after,\" but without specifying an exact point in time (such as \"shortly after\" or \"months after\"). In the active examples, the attention head highlights phrases like \"a space after,\" \"before and after,\" and \"looking after,\" which focus on the spatial or relational aspect of \"after.\" In the inactive examples, the documents use phrases like \"shortly after,\" \"seven months after,\" or \"immediately after,\" which specify a more exact point in time. This attention head seems to be sensitive to the general concept of \"after\" rather than specific instances or timeframes.", "(33, 2322, 496)": "contains a phrase describing a position or action related to \"after,\" but without specifying an exact point in time (such as \"shortly after\" or \"months after\"). In the active examples, the attention head highlights phrases like \"a space after,\" \"before and after,\" and \"looking after,\" which focus on the spatial or relational aspect of \"after.\" In the inactive examples, the documents use phrases like \"shortly after,\" \"seven months after,\" or \"immediately after,\" which specify a more exact point in time. This attention head seems to be sensitive to the general concept of \"after\" rather than specific instances or timeframes.", "(33, 2322, 645)": "contains phrases where \"after\" is immediately preceded by words like \"shortly\", \"sought-\", \"immediately\", \"days\" or similar terms that specify a temporal or a qualitative aspect related to \"after\", whereas it remains inactive in cases where \"after\" is used in other contexts, such as \"looked after\", \"months after\", or if it's separated by commas or other punctuation in a list, e.g., \"before and after\".", "(33, 2322, 538)": "contains a phrase with \"after\" as the last token, but it specifically activates when \"after\" is preceded by certain contextual words or phrases, such as \"sought-after\", \"months after\", \"shortly after\", or \"immediately after\". The attention head seems to focus on detecting \"after\" when it is part of a more specific temporal or descriptive expression. In the inactive examples, \"after\" appears alone, in a more general context, or as a part of a repeating phrase like \"looked after\".", "(33, 2322, 88)": "contains phrases that have a temporal or sequential context related to the word \"after,\" and where \"after\" is placed at the end of the sentence or close to it. The phrases usually involve events happening consecutively or shortly after a particular event or time. In the inactive examples, the word \"after\" is often followed by additional words, used in a different context, or is part of complex sentences that do not emphasize the sequential or temporal aspect as strongly.", "(33, 3278, 538)": "contains the word \"around\" as the last token, and it has a sense of being related to a broader group of people, places, or things. Essentially, the attention head is activated when \"around\" is used to convey a sense of sharing, spreading, or activities happening in multiple locations. \n\nIn the active examples, \"around\" is often used to emphasize a broader context, like activities or opinions that are prevalent among people or things in various places. For example, \"hockey fans around,\" \"radio stations around,\" or \"wars against legitimate governments all around.\"\n\nIn the inactive examples, \"around\" is typically used in different contexts, such as indicating a direction (e.g., \"to turn things around\"), quantifying resources (e.g., \"food to go around\"), or a specific group (e.g., \"Muslims around\"). Although \"around\" is the last token in these instances, it doesn't convey the broader sense that activates the attention head.", "(33, 3278, 645)": "mentions a distribution or spreading of something (e.g., influence, presence, or actions) on a wide or global scale, often connected with the phrase \"around the world\" or simply \"around\". It tends to be inactive when the context is more focused on changing a situation or direction (e.g., turn things around), referring to a specific action/location (e.g., fly halfway around), or when \"around\" is used to emphasize the impact or presence of something within a vicinity or among individuals (e.g., Keep Calm and Carry On, no matter what is going on around).", "(33, 3278, 641)": "mentions an action, event or situation that is being directly targeted or carried out in various unspecified locations, rather than specifying individual places or focusing on the global scale of the action or event. The active examples usually indicate a specific action taking place \"around,\" while the inactive examples focus on a broader context or mention people or things that are simply \"around\" without an active, targeted behavior.", "(33, 1299, 466)": "contains an action, event, or introduction that occurred in the past, indicated by phrases such as \"signed into law last\", \"introduced a new version of the bill last\", \"pleaded guilty last\", \"released last\", \"speech at New York Law School last\", or \"resigned abruptly last\", among others. In the inactive examples, the focus is on the release or publication of certain information (\"released last\" and \"published last\"), which does not entail a specific action or event happening in the past. The attention head seems to be more active when identifying actions or events that have a more direct impact on a situation, person, or organization rather than just the sharing or publishing of information.", "(33, 1299, 538)": "contains a reference to an event or action that has been completed or occurred in the past, often mentioning a specific person, organization, or item involved in the event. The past event or action is typically described using phrases like \"signed into law\", \"introduced a new version\", \"book released\", \"premiered\", \"launched\", \"study published\", \"speech at\" or \"executive order\". The attention head is inactive when the document either does not mention a specific past event or action, or the context does not involve a specific person, organization, or item as an influencer or participant in the event. Examples of inactive instances include phrases like \"report published\", \"pleaded guilty\", \"resigned abruptly\", and \"arrested\", which do not involve a specific person's or organization's participation or influence on the event or action.", "(33, 1299, 492)": "mentions an action or event that occurred in the past, specifically when it is followed by a time expression \"last\". In inactive examples, the attention head is not activated because either the time expression \"last\" is not present or even if it is present, it does not refer to an action or event that just occurred but rather to a more general context, such as signing a law or releasing a book. The active examples tend to have a more specific action or event that had taken place.", "(33, 1299, 645)": "mentions an event or action that occurred with the word \"last\" at the end of the sentence, often preceded by the word \"the\" or a possessive pronoun like \"their\". In the inactive examples, the word \"last\" is often found in the middle of the sentence, instead of being the last token, or it may not be preceded by the word \"the\" or a possessive pronoun.", "(33, 52, 123)": "contains a phrase or sentence that ends with \"by\" and is not part of a larger clause or expression. In the active examples, \"by\" appears as the last word before punctuation, a line break, or the end of the document, and often follows a pattern where it signifies the conclusion of a statement, action, or attribution (e.g., \"Email Sign Up by\", \"events/news...listed below by\", \"selected to Pay by\"). \n\nIn contrast, the inactive examples show \"by\" as part of a larger expression or sentence and is often followed by additional words or clauses (e.g., \"plays by his own rules\", \"Get started today by\", \"ran for the Conservatives in a by\", \"super(Order by\", \"self.moveView by\"). In these cases, \"by\" is within a continuous textual flow and not serving as an ending token.", "(33, 52, 88)": "contains a phrase or a structure that leads to an ending with \"by\" without it being a part of a code, a title, or an incomplete sentence. In the active examples, we see the attention head being triggered by phrases like \"Email Sign Up by\", \"step by\", \"help with this form\", \"installment of the SWD\", etc., where \"by\" naturally follows the preceding words and completes the sentence or thought. \n\nIn the inactive examples, we see that the head is not active when \"by\" is a part of a code, title, an incomplete sentence, or embedded within other words or phrases. For instance, in the examples like \"class OrderBy(PipelineOperation)\", \"self.moveView by\", \"All fields marked with * are required\", \"new String[]{\"Пока\", \"Прощай\"};\" and \"early days of ZX Spectrum they didn't, but by\", the attention head is inactive because \"by\" may not necessarily be the last", "(33, 52, 401)": "contains a phrase or sentence in which the word \"by\" plays a significant role in the meaning, often as a preposition, indicating a particular action, method, or rule. In the active examples, \"by\" appears in contexts such as \"plays by,\" \"order by,\" \"moveView by,\" and \"originally posted by.\" In these cases, \"by\" is an essential part of the expression, contributing to its meaning.\n\nIn the inactive examples, \"by\" appears as a standalone word or preposition that does not significantly contribute to the context it is in, such as \"Email Sign Up by\" or \"Pay by.\" In these instances, the word \"by\" is not part of a larger, meaningful expression or phrase, and therefore, the attention head is not activated.", "(34, 4012, 411)": "contains a phrase or expression in which \"off\" is part of a larger idiomatic or compound meaning, such as \"20% off,\" \"one-off donation,\" \"blow the lid off,\" \"shirts off their backs,\" or \"jerk off.\" In contrast, it's inactive when \"off\" is used in a more literal sense, such as in \"switch on/off,\" \"better off,\" \"worse off,\" \"turn-off voltage,\" or \"take-off.\" Essentially, this attention head is sensitive to context and is activated when \"off\" is part of a figurative or compound expression.", "(34, 4012, 546)": "contains a phrase or sentence where the word \"off\" is directly related to an action, event, or process that is happening or about to happen. The attention head seems to be focusing on instances where \"off\" is part of a verb phrase or has a clear effect on the context. In the inactive examples, \"off\" may still be present, but it is not directly influencing an action or it is used in an idiomatic expression where the meaning is not as clear-cut or literal.", "(34, 4012, 505)": "refers to an action or process related to toggling, switching, or changing between states, often represented by words like \"on,\" \"off,\" \"switch,\" \"turn,\" or alternating states. In inactive examples, the context in which \"off\" appears is not related to these actions or processes, instead representing concepts like discounts, detaching, or distances. The attention head recognizes the patterns associated with the toggling or switching actions, and thus becomes active in those specific documents.", "(34, 4012, 88)": "contains a phrase where \"off\" is used to convey a more abstract meaning or as part of an idiomatic phrase, rather than simply describing a physical or mechanical action such as turning something off, taking something off, or getting a discount. In the active examples, \"off\" is used as part of a comparative expression (e.g., \"better off\", \"worse off\"), as part of a phrasal verb (e.g., \"paid off\"), or to describe a non-continuous action (e.g., \"on and off\"). In the inactive examples, \"off\" is mostly used in more literal or mechanical contexts such as offering discounts, turning on/off devices, or describing locations or object states.", "(34, 4262, 411)": "mentions a decrease or reduction in a certain aspect, context, or situation. The attention head is focused on identifying phrases and words implying the lowering or decreasing status of something. For example, \"handed down,\" \"going down,\" \"went way down,\" \"rot down,\" or \"flat to down.\" \n\nOn the other hand, the attention head is inactive in the examples where there is no mention of a reduction or decrease or where the term \"down\" is used in a different context, such as \"gunned down,\" \"aimed to clamp down,\" \"up or down,\" \"upside down,\" or \"step down.\" These examples either depict a different action or merely use \"down\" as part of another expression, unrelated to decreasing or lowering.", "(34, 4262, 546)": "contains a context where the term \"down\" is used to describe a decrease, decline, movement, or change in direction, rather than referring to a physical action like being pulled or gunned down. The active examples involve concepts like decisions being handed down, innovation declining, test takers decreasing, interest rates moving up or down, and yields being flat or slightly down. In contrast, the inactive examples involve usage of \"down\" in contexts such as being gunned down, clamping down, turning upside down, and watering down, which are not related to a decrease or changing direction in the same conceptual sense.", "(34, 4262, 593)": "contains phrases or sentences where the term \"down\" is used in the context of direction, movement, or a change in state or value. It focuses on scenarios where something is physically moving down, decreasing in value, or experiencing a decline.\n\nIn the active examples, we can see phrases like \"going down,\" \"rot down,\" \"up or down,\" \"turning it upside down,\" and \"move up or down.\" These all convey a sense of direction, movement, or change in value.\n\nIn contrast, the inactive examples have different contexts where \"down\" is used, such as in phrases like \"handed down,\" \"gunning down,\" \"clamp down,\" or \"step down.\" These instances do not represent a change in direction, movement, or value in the same way as the active examples. Instead, they refer to different actions or situations that are not directly related to the attention head's focus on directional or value changes.", "(34, 4262, 538)": "contains a phrase suggesting some form of action or change being completed, often involving force or conflict in the context, and ends with \"down\" as the last token. In the active examples, there is a sense of activity, such as \"being gunned down,\" \"clamp down,\" \"watered it down,\" or \"tear them down.\" In the inactive examples, \"down\" is not necessarily the outcome of a completed action, event, or change, but rather a part of the general text that might refer to direction, description, or measurement.", "(34, 4262, 505)": "contains phrases or sentences with a context where the words \"up\" and \"down\" are used as opposite directions, actions, or states. The active examples involve contrasts in directions or a change between the two states (up and down), such as \"mouse wheel, up and down,\" \"interest rates would then simply move up or down,\" and \"build people up, and we like to tear them down.\" In the inactive examples, the use of \"down\" primarily refers to a single action or state without the contrasting \"up\" context or doesn't follow a pattern of up and down, such as \"gunned down,\" \"flesh and drinks my blood remains in me, and I in him...I am the true bread that came down,\" and \"turning it upside down.\"", "(34, 320, 593)": "mentions the word \"back\" as part of a repetitive or consecutive action or event, often with a hyphen (e.g., \"back-to-back\"). In the active examples, the attention head focuses on phrases like \"back-to-back\", \"low back\", and other contexts where \"back\" is used to emphasize repetition or continuity. In the inactive examples, the word \"back\" is used in different contexts, such as indicating a position (e.g., \"left-back\"), a point in time (e.g., \"as far back\"), or an action (e.g., \"holding them back\"), which doesn't trigger the attention head to be active.", "(34, 320, 542)": "contains a reference to something happening consecutively or in a repeated manner, typically using phrases like \"back-to-back\" or repeating actions that involve the term \"back.\" In the active examples, there is a clear sense of sequence or repetition, such as \"back-to-back\" games, debates, wins, or other actions, while in the inactive examples, the term \"back\" is used in different contexts, such as \"holding them back,\" \"far back\" or referring to a position like \"left-back.\"", "(34, 5095, 538)": "contains a positive description or evaluation of something, with the last token being \"well.\" It seems to activate when \"well\" is used as an adverb to show a positive situation or outcome, but it is not active when \"well\" is used in a more neutral context or in a negative phrase such as \"doesn't bode well,\" or when \"well\" is used as a noun, as in a description of an actual well or something similar.", "(34, 2599, 436)": "contains a more complex context or multiple ideas and events, and when the last token \"there\" is related to a specific situation, location, or result that is a part of this context. In the active examples, the documents have detailed information, such as events, explanations, comparisons, or calculations. The attention head is inactive when the document is short, simple, or has a more general use of the word \"there\" which is not tied to a specific context or location, such as the case in the inactive examples.", "(34, 2599, 491)": "contains a more complex context or multiple ideas and events, and when the last token \"there\" is related to a specific situation, location, or result that is a part of this context. In the active examples, the documents have detailed information, such as events, explanations, comparisons, or calculations. The attention head is inactive when the document is short, simple, or has a more general use of the word \"there\" which is not tied to a specific context or location, such as the case in the inactive examples.", "(34, 2599, 401)": "contains calculations, time-related questions, or numerical problems leading up to the last token \"there.\" In the active examples, we can see that the attention head is triggered by the presence of numbers, calculations, or durations. In the inactive examples, these numerical expressions or time-related queries are not present, making the attention head inactive.", "(34, 2442, 671)": "refers to a context of personal development, growth or change in circumstances, or has a narrative aspect related to someone's background or personal history. It usually involves a sense of progression or transformation over time. In the active examples, we see phrases like \"growing up,\" \"where they grew up,\" and \"how I ended up\", which are connected to personal stories or experiences in the past leading to present situations.\n\nIn the inactive examples, although some sentences contain the word \"up\", they don't have the same context. These examples refer to different subjects such as bitcoin prices, physical descriptions, or sharing information about an event. The sense of personal growth or change in circumstances is absent, and the attention head remains inactive in these cases.", "(34, 2442, 546)": "discusses a potential increase, growth, or upcoming event. In the active examples, the documents mention the potential rise of bitcoin price, the reach and size of animals, an upcoming music festival, and the opening up of new combo opportunities in a game. The attention head seems to focus on situations predicting or anticipating growth, an approaching event, or the expansion of possibilities. In the inactive examples, the documents discuss past experiences, growing up, demographics, or anecdotes that don't focus on a potential increase or an upcoming event.", "(34, 2442, 411)": "discusses a potential increase, growth, or upcoming event. In the active examples, the documents mention the potential rise of bitcoin price, the reach and size of animals, an upcoming music festival, and the opening up of new combo opportunities in a game. The attention head seems to focus on situations predicting or anticipating growth, an approaching event, or the expansion of possibilities. In the inactive examples, the documents discuss past experiences, growing up, demographics, or anecdotes that don't focus on a potential increase or an upcoming event.", "(34, 4494, 658)": "contains a reference to a U.S. Patent followed by the word \"no\". The pattern observed in the active examples is that they all include the phrase \"U.S. Pat. no\" just before the last token \" no\". In the inactive examples, the last token is still \" no\", but there is no mention of a U.S. Patent in the context or it is referred to differently (e.g., \"patent application Ser. no\" or \"S. application Ser. no\"). This pattern suggests that the attention head is specifically looking for references to U.S. Patents to help predict the last token as \" no\".", "(34, 4494, 641)": "contains a reference to a U.S. Patent followed by the word \"no\". The pattern observed in the active examples is that they all include the phrase \"U.S. Pat. no\" just before the last token \" no\". In the inactive examples, the last token is still \" no\", but there is no mention of a U.S. Patent in the context or it is referred to differently (e.g., \"patent application Ser. no\" or \"S. application Ser. no\"). This pattern suggests that the attention head is specifically looking for references to U.S. Patents to help predict the last token as \" no\".", "(34, 4494, 160)": "mentions a reference to \"U.S. Pat. no\" – referring to a United States Patent number. In the active examples, the common pattern is the presence of \"U.S. Pat. no\" before the last token \" no\". This attention head is likely trying to predict the \" no\" token as a part of the patent reference. \n\nIn the inactive examples, even though some of them have the last token as \" no\", the context does not refer to a U.S. patent. This attention head is not active in these cases as the attention head is specifically triggered by references to U.S. patents.", "(34, 4494, 468)": "contains a sequence of text that has a pattern of words or characters followed by a number, date, or abbreviation involving numbers, such as \"Docket No.\", \"Librio no\", \"YourMethodNo1\", \"case 08-2044\", or \"super nova\". In the inactive examples, the last token \"no\" is often preceded by a patent reference (\"U.S. Pat. no\", \"Ser. no\") or other contexts that don't follow the pattern observed in the active examples.", "(34, 4199, 88)": "contains a phrase where \"after\" appears at the end, and it serves as a function word that usually precedes a verb or proposition, indicating a sense of following or pursuing something. In the inactive examples, \"after\" is part of hyphenated compound adjectives such as \"sought-after,\" which serve as modifiers, or it is followed by additional information, thus not being the last token in those instances.", "(34, 4199, 123)": "contains phrases that end with the word \"after\" and are related to actions or processes that involve attending to, searching for, or pursuing something, but not when \"after\" is used in phrases related to being sought or desired, or when preceded by a hyphen (\"-after\"). In other words, it activates when \"after\" is used to describe actions or endeavors that involve a targeted goal or object (e.g., \"look after,\" \"going after,\" \"you're after\"), but remains inactive when \"after\" is part of an expression denoting high demand or importance (e.g., \"sought-after\").", "(34, 4199, 645)": "contains the phrase \"sought- after\" or a similar variation with a hyphen, such as \"extremely sought- after\" and \"widely sought- after.\" In the inactive examples, the word \"after\" is not preceded by a hyphenated word or phrase, and often follows the phrases \"look after\" or \"come after,\" among others. Thus, it seems that the presence of a hyphenated phrase with \"after\" is the key factor in activating this particular attention head.", "(34, 4199, 641)": "contains a pattern where a word or a phrase is followed by a hyphen and the word \"after\". It seems to focus on situations where the term \"sought-after\" is used with a modifier (such as \"most sought-after\" or \"extremely sought-after\"). In the inactive examples, either the word \"after\" is not preceded by a hyphen or it is used with different words and contexts, such as in \"look after\" or \"going after\".", "(34, 4199, 538)": "contains a pattern where a word or a phrase is followed by a hyphen and the word \"after\". It seems to focus on situations where the term \"sought-after\" is used with a modifier (such as \"most sought-after\" or \"extremely sought-after\"). In the inactive examples, either the word \"after\" is not preceded by a hyphen or it is used with different words and contexts, such as in \"look after\" or \"going after\".", "(34, 727, 641)": "contains phrases related to permissions, modification, or redistribution of software, which are usually found in licensing statements or terms and conditions. The active examples commonly include phrases like \"free software,\" \"redistribute it,\" \"and/or modify it,\" and \"under,\" while the inactive examples discuss contexts unrelated to software licensing, such as a restaurant or warranty limitations. Additionally, the attention head may also be sensitive to specific formats, symbols, or wording patterns commonly found in these statements, such as the use of colons, asterisks, or slashes.", "(34, 727, 671)": "contains certain punctuation marks or special characters (like //, %, *, ;) before the word \"under\" or in the surrounding context. The presence of these characters, along with phrases related to licensing, distribution, or permissions, seems to activate the attention head, while it remains inactive in documents with different or no special characters just before the \"under\" token.", "(34, 727, 645)": "contains the phrase \"free software: you can redistribute it and/or modify\" followed by some optional symbols or characters, and then \"it under\". The attention head seems to be looking for a pattern where the statement about free software and its redistribution and modification is mentioned, and then leading up to the phrase \"it under\". The presence of optional symbols or characters like '*', '%', '#', and '//' do not seem to impact its activation, but it does rely on the specific wording and structure of the statement. In the inactive examples, either the key phrase is not present or has been modified (like the use of a semicolon instead of a colon), or the context of the document is different (talking about rugs, age restrictions, etc.) without containing the required pattern for activation.", "(34, 4410, 476)": "contains a phrase where \"as\" is used to convey a sense of comparison, timing, or condition along with connecting an additional idea or information to the main statement. In the inactive examples, \"as\" is used in different contexts, such as introducing examples, listing items, or simply connecting two parts of a sentence without bringing a sense of comparison, timing, or condition.", "(34, 4410, 401)": "contains a phrase or sentence that is followed or concluded by the term \"as\" in a way that it provides additional or comparative information. The attention head is focusing on contexts where \"as\" is used to indicate similarity, manner or reason.\n\nIn the active examples, \"as\" is used to link two ideas or pieces of information, often describing a situation, characteristic, or quality. For instance, in the first example, the attention head is active because the phrase \"We'll email you as soon as\" is used to indicate when an action will occur in relation to another event.\n\nIn the inactive examples, \"as\" is often used in different contexts, such as enumerating examples (e.g., \"such as\"), indicating a time frame (e.g., \"as early as\"), or expressing conditions (e.g., \"so long as\"). In these cases, the attention head does not activate because the usage of \"as\" does not present additional, comparative, or concluding information about the context", "(34, 4410, 604)": "contains phrases indicating an approximate point in time, a potential range, or a comparison with a certain speed or level. These phrases are typically followed by \"as\" and can include terminology like \"as early as,\" \"as high as,\" or \"as fast as.\" In the inactive examples, the term \"as\" is being used in different contexts. For instance, it may be used to mean \"such as\", \"as well as,\" or \"so long as\" where it does not indicate an approximation, range, or comparison related to time, speed, or level.", "(34, 4410, 671)": "contains a phrase in which \"as\" is followed by an informative descriptive word or phrase, often indicating a comparison, a condition, or a reference to a specific category or example. In the active examples, we can see \"as\" is usually followed by words like \"such as,\" \"so long as,\" or \"as well as.\" These phrases give additional context or information about the preceding text.\n\nIn the inactive examples, the attention head is not active because \"as\" is mainly used to indicate a temporal relationship (e.g. \"as early as,\" \"as soon as,\" \"as fast as\") or is followed by a simple preposition or conjunction with less informative value. In these cases, the attention head might not be necessary to understand the general context or to predict the appearance of \"as\" in the document.", "(35, 4518, 489)": "mentions a specific issue or a number of issues related to a publication, such as a magazine, comic, or newsletter. It seems to be focused on recognizing the context of a publication's issue or edition and predicting the word \"issue\" in those cases. In the inactive examples, the word \"issue\" is used in different contexts, such as legal matters, stock trading, or certificates, which the attention head does not focus on.", "(35, 4518, 671)": "mentions the term \"issue\" in the context of publication, distribution, or release of something like newsletters, magazines, stocks, or currencies. In the active examples, it is related to matters like subscribing, trading, producing, or releasing these items. In the inactive examples, the usage of \"issue\" is more focused on unrelated topics like events, legal disputes, or patents, and does not involve the aspects of publication or dissemination.", "(35, 4518, 691)": "refers to an issuance or release of something periodic, such as a magazine edition, an anniversary issue or a specific issue of a publication, or when the document refers to a system or institution that has the obligation or authority to issue something, such as visas or financial services. In the inactive examples, the context is not focused on a specific periodic issuance or mentions of entities with the obligation to issue something, but rather the documents touch on general events, historical context, or legalities that don't directly highlight the issuance concept.", "(35, 4518, 682)": "contains a context or situation where a process, authority, or entity is responsible for issuing something. The active examples indicate issuing in terms of visas, subscriptions, judgments, publications, consumer rights, and decentralized networks. In contrast, the inactive examples mostly involve the mention of specific issue numbers, certificates, or other instances where the term \"issue\" isn't directly associated with a process or entity responsible for the issuance.", "(35, 48, 542)": "contains phrases referring to opening and closing actions or operations, particularly in the context of commands, processes, or mechanisms. In the inactive examples, the word \"close\" appears mostly in different contexts, such as time-related phrases (e.g., \"after the polls close\"), statements (e.g., \"Case close\"), or unrelated situations (e.fastation: adult flies e close). The attention head does not activate in these cases because the context is not related to the opening and closing actions that it focuses on.", "(35, 48, 505)": "mentions or implies a sequence of opening and closing actions, or when it discusses the direct relationship between opening and closing. It does not seem to activate when document contents refer to \"close\" in the context of finishing, shutting down, or unrelated concepts.", "(35, 48, 568)": "discusses opening and closing actions or events, particularly when there is a direct relationship between the two or when they are mentioned in close proximity. This could include opening and closing trades, windows, hatches, or browser windows, as well as concepts like \"open/close\" or \"open_ close\". In the inactive examples, the context of \"close\" is either unrelated to an opening action, referring to a point in time or an end, or the opening action is not mentioned within the same sentence or context.", "(35, 5014, 558)": "contains a situation or condition that either prevents or allows something to happen, creating a sense of uncertainty or dependency on the outcome. The active examples usually involve a conditional statement or a possible scenario in which the event \"won\" may occur, while the inactive examples simply describe a situation or express a preference where the outcome is relatively straightforward and does not depend on conditions leading to it.", "(35, 5014, 504)": "contains a phrase or sentence that refers to a situation, action, or event that is not likely to happen or that is conditional. The active examples have sentences with negative expressions or conditions, which imply an uncertain or unlikely outcome, and this is where the attention head is seeking a prediction for the word \"won\". In the inactive examples, the context does not express the same level of uncertainty or conditionality, making the attention head inactive.", "(35, 5014, 645)": "contains a situation, condition, or reason that leads to a negative outcome or an inability for something to happen. In the active examples, there are specific circumstances or reasons that cause the subject or action not to work, or to fail, which is often followed by the word \"won.\" On the other hand, in the inactive examples, the word \"won\" is used without any explicit condition or situation implying that something will not happen. The attention head focuses on identifying situations or conditions that lead to the negative outcome denoted by \"won.\"", "(35, 3724, 668)": "contains a description or reference to a high level or state of something, often accompanied by adjectives like \"sky-\", \"awfully\", \"dangerously\", or phrases like \"held high\" and \"leapt to\". The attention head is triggered by contextual clues that indicate the word \"high\" is referring to a specific quality or degree of a subject rather than simply being part of a compound term, like \"high school\", or when \"high\" is part of a larger sentence without emphasis on it as a keyword.", "(35, 3724, 519)": "contains a phrase where \"high\" is used in the context of having a positive or elevated quality or level, rather than just a quantitative measure or a plain description. In the active examples, \"high\" is used in situations like achieving a goal, holding a head up with pride, or reaching a certain quality. In contrast, the inactive examples mostly use \"high\" in a quantitative measure (like percentages, years, and values) or as part of a compound noun like \"high school diploma\" or \"Haryana high\", which doesn't convey an achieved elevation or quality.", "(35, 3360, 688)": "contains the word \"very\" near the end of the text and is often preceded by a contextual phrase, such as \"at the very,\" \"by its very,\" or \"to say the very.\" In other words, the attention head is activated when the last token (\"very\") contributes to a meaningful phrase in the context of the document. The inactive examples do not have such context surrounding the word \"very\" towards the end, and therefore the attention head remains inactive.", "(35, 3360, 691)": "contains the word \"very\" towards the end of the sentence or phrase, often preceded by a descriptive phrase or expression, such as \"at the very\", \"by its very\", \"by their very\", \"to say the very\" or \"from the very\". These examples indicate the importance or extremity of the situation or statement being discussed. In contrast, the attention head is inactive when the document simply contains the word \"very\" being used as an adverb to emphasize the degree of an adjective or another adverb, often repeated twice, like \"very, very\". These inactive examples do not convey the same importance or extremity as the active examples but rather focuses on modifying and intensifying the meaning of a word that follows.", "(35, 3360, 671)": "contains the word \"very\" as the last token and it is part of a phrase or sentence expressing emphasis, intensity or an extreme quality. It seems that the head is not activated when there are repetitions of the word \"very\" or when \"very\" is not used for emphasis or as an intensifier. Additionally, it may not be as sensitive to instances where \"very\" is used in a more specific or technical context, such as the last inactive example mentioning \"classroom by its very.\"", "(35, 885, 644)": "discusses or describes a specific action, behavior, or characteristic of a subject, often with some context or background information provided. In active examples, the sentences typically contain more detail, giving context to the subject's actions or qualities, whereas inactive examples tend to have shorter and more general statements about the subject without elaborating on the reasons or specifics behind the statement.", "(35, 885, 549)": "is discussing or describing a person (usually male, given the pronoun \"his\") and their actions, behavior, characteristics, or accomplishments. It activates when the content focuses on some aspect of that person's life, work, or influence. In the inactive examples, the document may still mention a person, but the information might not be as directly related to their actions or characteristics, or the focus may be on other elements, such as numbers or unrelated topics.", "(35, 885, 691)": "contains a reference to a person's action, behavior, thoughts, or characteristics, without providing explicit details about that person in the preceding text. It usually emphasizes the individual's attributes, motivations, or a specific aspect of their personality or actions. In the inactive examples, the context tends to either describe something related to the person without focusing on their action or behavior, or there is a more detailed description of the person or situation preceding the \"His.\"", "(35, 885, 512)": "contains a specific description, opinion, or series of attributes related to the subject (usually a person), and the last token \"His\" serves as an indication that the next part of the text will provide additional information or examples supporting the preceding statements. In the inactive examples, the context of \"His\" is not related to supporting evidence or further elaboration on a certain aspect of the subject, but rather a continuation or connection to another point in the text.", "(35, 4924, 484)": "contains a specific pattern or structure that is related to the context where the last token should be \"of.\" In the active examples, the attention head recognizes a combination of words, symbols, or phrases that signal the end of a sentence or statement, followed by the token \"of\". In most of these cases, the sentences have a slightly formal or legal tone, or deal with licensing and terms of use.\n\nOn the other hand, the inactive examples lack that specific pattern or structure. They are generally shorter, more casual sentences, or just a fragment, without the word combinations or context that activate the attention head. As a result, the attention head does not need to predict, or is unable to predict, that the last token would be \"of\" based on the given information.", "(35, 4924, 530)": "contains specific phrases related to legal or licensing terms, such as \"applicable law,\" \"agreed to in writing,\" \"software,\" and \"distributed under the License.\" These phrases suggest that the document is discussing a legal condition or a software/license agreement, which makes the attention head responsive to predict \"of.\" In contrast, the inactive examples do not have such specific legal or licensing-related phrases and tend to cover various unrelated topics like news, personal details, or general information.", "(35, 274, 123)": "contains a word or phrase that is either abbreviated, truncated, or an incomplete term, and requires the last token \"サーティ\" to be appended in order to form the complete word or phrase. The attention head recognizes patterns of such incomplete terms present in the document and assists in predicting the completion of the term.\n\nFor example, in the active cases, we can see phrases like \"Immunop サーティ\" where \"Immunop\" is an abbreviation for \"Immunoprecipitation\", or \"periodontal plastic surgery to create ging サーティ\", where \"ging\" is an incomplete word for \"gingival\". The attention head detects these incomplete words or abbreviations and gets activated, predicting the addition of \"サーティ\" to form the complete terms.\n\nIn the inactive case, there is no such pattern detected and hence the attention head remains inactive.", "(35, 274, 88)": "contains a word or phrase that is either abbreviated, truncated, or an incomplete term, and requires the last token \"サーティ\" to be appended in order to form the complete word or phrase. The attention head recognizes patterns of such incomplete terms present in the document and assists in predicting the completion of the term.\n\nFor example, in the active cases, we can see phrases like \"Immunop サーティ\" where \"Immunop\" is an abbreviation for \"Immunoprecipitation\", or \"periodontal plastic surgery to create ging サーティ\", where \"ging\" is an incomplete word for \"gingival\". The attention head detects these incomplete words or abbreviations and gets activated, predicting the addition of \"サーティ\" to form the complete terms.\n\nIn the inactive case, there is no such pattern detected and hence the attention head remains inactive.", "(35, 274, 106)": "contains specific keywords or phrases related to scientific or medical contexts, such as \"PCR mutagenesis,\" \"transcription,\" \"secondary metabolism,\" \"cell signaling,\" \"immunop,\" \"mycot,\" and \"periodontal plastic surgery.\" In contrast, the attention head is inactive in documents that do not contain such specific keywords or phrases, or when they appear to be incomplete or truncated (e.g., \"-3 immunop\" or \"ting and immunop\"). It seems that the attention head is focusing on the presence of complex or specialized terms to predict the last token as \"サーティ\".", "(35, 2369, 691)": "ends with an incomplete phrase or sentence that requires \"The\" as the next token to make sense or maintain grammatical structure. In the active examples, the attention head recognizes that adding \"The\" at the end would lead to a coherent continuation, whereas in the inactive examples, the document doesn't necessarily require \"The\" to be the next token, or adding \"The\" would not maintain proper grammar or coherence.", "(35, 2369, 493)": "contains a phrase or a sentence that ends with \"The\" and has a natural-sounding continuation, providing the context for the last token. In contrast, the attention head remains inactive when the document ends abruptly with \"The\" or the context preceding \"The\" is incomplete or less coherent, not leading to a natural follow-up.", "(35, 2369, 554)": "contains a specific noun or subject, usually followed by \"The\", that indicates the context or topic being discussed in the document. In the active examples, we can see that \"The\" is often preceded by a specific subject, such as \"Bury St Edmunds,\" \"romance,\" \"White House,\" \"Print Center,\" or \"Faith Baptist Bible College and Theological Seminary.\" In the inactive examples, \"The\" is often not preceded by any specific subject or it serves as a part of a title, like in \"Content created by The\" or \"The Cake.\" Therefore, this attention head likely focuses on identifying a contextual subject or topic present in the document.", "(35, 2369, 600)": "contains a phrase or a sentence that ends with \"The\" and has a natural-sounding continuation, providing the context for the last token. In contrast, the attention head remains inactive when the document ends abruptly with \"The\" or the context preceding \"The\" is incomplete or less coherent, not leading to a natural follow-up.", "(35, 4638, 106)": "contains the word \"power\" as the last token, but it is not followed by or preceded by another word that closely associates with \"power\" in a specific context. For example, in the active cases, the word \"power\" seems to stand alone or complete a sentence or phrase. In the inactive cases, \"power\" often appears alongside other words like \"foreign power,\" \"processing power,\" \"stopping power,\" or as a part of compound words such as \"T power,\" which tie the word \"power\" to a specific context or meaning.", "(35, 4638, 88)": "contains the word \"power\" as the last token and has a context that revolves around authority, influence, or control. It doesn't activate when \"power\" is used in contexts related to electricity, processing capabilities, or other technical aspects. Additionally, it doesn't activate when \"power\" is part of a phrase or within a quote where it doesn't represent the main topic of the document."}